const questions = [
    {
      category: "Critical Thinking",
      questions: [
        {
          id: "critical_1",
          text: "Can you describe a situation where you faced a complex problem? What steps did you take to analyze and solve it?"
        },
        {
          id: "critical_2",
          text: "How do you approach making important decisions when you have incomplete information or tight deadlines?"
        },
        {
          id: "critical_3",
          text: "Imagine you are given conflicting pieces of data to analyze. How would you determine which data is most reliable and why?"
        },
        {
          id: "critical_4",
          text: "If a car travels 60 miles in one hour, how long will it take to travel 150 miles at the same speed? Explain your reasoning."
        }
      ]
    },
    {
      category: "Creative Thinking",
      questions: [
        {
          id: "creative_1",
          text: "Can you share an example of when you came up with a creative solution to a challenge or introduced a new idea that added value?"
        },
        {
          id: "creative_2",
          text: "If you were tasked with designing a new app to improve daily productivity, what features would you include, and why?"
        },
        {
          id: "creative_3",
          text: "If you could reinvent any common object (like a pen or a chair), what would you change, and why?"
        }
      ]
    },
    {
      category: "Aptitude",
      questions: [
        {
          id: "aptitude_1",
          text: "What is the next number in the sequence: 2, 6, 12, 20...? Explain how you arrived at your answer."
        },
        {
          id: "aptitude_2",
          text: "Choose the word that best fits the analogy: 'Bird is to sky as fish is to _______. Why?"
        },
        {
          id: "aptitude_3",
          text: "You have three boxes: one labeled apples, one oranges, and one mixed. All labels are incorrect. By picking one fruit from one box, how can you correctly label all the boxes?"
        }
      ]
    },
    {
      category: "Caliber",
      questions: [
        {
          id: "caliber_1",
          text: "Describe a time when you were under significant pressure to meet a goal. How did you manage your time and resources?"
        },
        {
          id: "caliber_2",
          text: "What long-term goals are you currently working toward, and how are you planning to achieve them?"
        },
        {
          id: "caliber_3",
          text: "If your company suddenly shifted its entire focus to a different industry, how would you approach learning and adapting to the change?"
        }
      ]
    },
    {
      category: "General Personality Insights",
      questions: [
        {
          id: "personality_1",
          text: "What would you say is your greatest strength, and how has it helped you succeed? Conversely, what’s an area you are working to improve?"
        },
        {
          id: "personality_2",
          text: "Do you prefer working in a team or independently? Why? Can you provide an example of when you thrived in one of these settings?"
        }
      ]
    },
    {
      category: "Optional Questions (if needed)",
      questions: [
        {
          id: "optional_1",
          text: "Describe a time when you received critical feedback. How did you respond, and what did you learn from the experience?"
        },
        {
          id: "optional_2",
          text: "If you discovered a colleague was taking credit for your work, how would you handle the situation?"
        },
        {
          id: "optional_3",
          text: "If you were stranded on a deserted island and could take only three items, what would they be and why?"
        }
      ]
    }
  ];
  
  export default questions;
  